<a href="https://colab.research.google.com/github/brunonbn/intro-data-science/blob/main/OrganizandoDataFrames_Sort.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [4]:
# uma outra forma de criar um array com vários elementos do tipo string
list('321')

['3', '2', '1']

In [8]:
df = pd.DataFrame(data, index=list('321'), columns=list('ZYX'))
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [9]:
# fazendo a ordenação, mas pelo index do DataFrame
df.sort_index(inplace=True)

In [10]:
df

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

In [11]:
# fazendo a ordenação agora pelos valores de columns, usando o axis=1
df.sort_index(inplace=True, axis=1)
df

   X  Y  Z
1  9  8  7
2  6  5  4
3  3  2  1

In [12]:
# fazendo a ordenação pelos valores, definindo qual coluna será usada para ordenação
df.sort_values(by="X", inplace=True)
df

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

In [13]:
# fazendo a ordenação pelos valores, mas usando a ordenação horizontal (axis=1)
df.sort_values(by="3", axis=1, inplace=True)
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [14]:
# pode passar mais de um valor para ordenação
df.sort_values(by=["X", "Y"], ascending=False, inplace=True)
df

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3